src/Documents/ВходящийЗаказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Document>
		<Properties>
			<Name>ВходящийЗаказ</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьОжиданияОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьЭлектронногоОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектронногоОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьОжиданияДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИныхНалогов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ВходящийЗаказ/Ext/ObjectModule.bsl
Функция ЗагрузитьЭлементХМЛ(ОбъектXML, ИмяУзла, Параметры) Экспорт
	Перем СтрокаТовара, ТипНалога, ВалютаСтрок;
	
	Параметры.Свойство("СтрокаТовара", СтрокаТовара);
	Параметры.Свойство("ТипНалога", ТипНалога);
	
	Если ИмяУзла = "Заказ" Тогда
		
	ИначеЕсли ИмяУзла = "ДлительностьОжиданияОтвета" Тогда
		ДлительностьОжиданияОтвета = ЭлектронныеДокументы.ПолучитьДлительностьЭлемента(ОбъектXML);
		
	ИначеЕсли ИмяУзла = "ИдСклада" Тогда
		
		Если ОбъектXML.КоличествоАтрибутов() и ОбъектXML.ПрочитатьАтрибут() Тогда
			Склад = ОбъектXML.Значение;
		КонецЕсли;
		
	ИначеЕсли ИмяУзла = "ИдПолучателяТовара" Тогда
		
	ИначеЕсли ИмяУзла = "ДатаВремяДоставки" Тогда
		ДатаДоставки = ЭлектронныеДокументы.ПолучитьДатуЭлемента(ОбъектXML);
		
	ИначеЕсли ИмяУзла = "ДлительностьОжиданияДоставки" Тогда
		ДлительностьОжиданияДоставки = ЭлектронныеДокументы.ПолучитьДлительностьЭлемента(ОбъектXML);
		
	ИначеЕсли ИмяУзла = "Товар" Тогда
		
		СтрокаТовара = Товары.Добавить();
		Параметры.Вставить("СтрокаТовара",СтрокаТовара);
			
	ИначеЕсли   ИмяУзла = "ИдТовара" Тогда
		ЭлектронныеДокументы.ЗаполнитьНоменклатуруИХарактеристикуПоИдентификатору(СтрокаТовара, ЭлектронныеДокументы.ПолучитьТекстЭлементаХМЛ(ОбъектXML), Параметры);
		
	ИначеЕсли ИмяУзла = "Количество" Тогда
		СтрокаТовара.Количество = ЭлектронныеДокументы.ПолучитьЧислоЭлемента(ОбъектXML);
		
	ИначеЕсли ИмяУзла = "Стоимость" Тогда
		
	ИначеЕсли ИмяУзла = "Сумма" и ТипНалога = Неопределено Тогда
		
		ЭлектронныеДокументы.ПрочитатьВалютуДокумента(ЭтотОбъект, ОбъектXML, Параметры);
		
		СтрокаТовара.Сумма = ЭлектронныеДокументы.ПолучитьЧислоЭлемента(ОбъектXML);
	
	ИначеЕсли ИмяУзла = "Налог" Тогда
		
	ИначеЕсли ИмяУзла = "ТипНалога" Тогда
		
		Параметры.Вставить("ТипНалога", вРег(ЭлектронныеДокументы.ПолучитьТекстЭлементаХМЛ(ОбъектXML)));
		
	ИначеЕсли ИмяУзла = "ВеличинаСтавкиНалога" Тогда
		
		Если ТипНалога = "НДС" Тогда
			СтрокаТовара.СтавкаНДС = Перечисления.СтавкиНДС["НДС" + ЭлектронныеДокументы.ПолучитьТекстЭлементаХМЛ(ОбъектXML)];
		КонецЕсли;
		
	ИначеЕсли ИмяУзла = "Сумма" и Не ТипНалога = Неопределено Тогда
		
		ЭлектронныеДокументы.ПрочитатьВалютуДокумента(ЭтотОбъект, ОбъектXML, Параметры);
		
		Значение = ЭлектронныеДокументы.ПолучитьЧислоЭлемента(ОбъектXML);
		Если ТипНалога = "НДС" Тогда
			СтрокаТовара.СуммаНДС = Значение;
		Иначе
			СтрокаТовара.СуммаИныхНалогов = СтрокаТовара.СуммаИныхНалогов + Значение;
		КонецЕсли;
		
	ИначеЕсли ИмяУзла = "ВключеноВСтоимость" Тогда
		
		Если ТипНалога = "НДС" Тогда
			
			ВключеноВСтоимостьСтроки = ЭлектронныеДокументы.ПолучитьБулевоЭлемента(ОбъектXML);
			ВключеноВСтоимостьСтрок  = Неопределено;
			
			Если Параметры.Свойство("ВключеноВСтоимостьСтрок", ВключеноВСтоимостьСтрок) Тогда
				
				Если Не ВключеноВСтоимостьСтрок = ВключеноВСтоимостьСтроки Тогда
					ЭлектронныеДокументы.ДополинтьИнформациюДляСообщения(Параметры.ТекстОшибки, "Торговая система не поддерживает документы с различным способом включения НДС в цену товара в одном документе");					
				КонецЕсли;
			Иначе
				СуммаВключаетНДС = ВключеноВСтоимостьСтроки;
				Параметры.Вставить("ВключеноВСтоимостьСтрок", ВключеноВСтоимостьСтроки);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Параметры.Удалить("ТипНалога")
		
	ИначеЕсли ИмяУзла = "Примечание" Тогда
		
		СтрокаТовара.Примечание = ЭлектронныеДокументы.ПолучитьТекстЭлементаХМЛ(ОбъектXML);
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СуществуетИсходящийДокумент(СсылкаНаОтветныйДокумент = Неопределено) Экспорт
	
	СсылкаНаОтветныйДокумент = ЭлектронныеДокументы.НайтиПервыйОтветныйДокумент(Ссылка, "ИсходящийРеджектАкцептЗаказа");
	
	Возврат ЗначениеЗаполнено(СсылкаНаОтветныйДокумент);
	
КонецФункции // ()
